1. upload the used_car_dataset csv file and name it df

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('used_car_dataset.csv')

2. inspect your df, use at least head, info and describe

In [4]:
df.head()

,Brand,model,Year,Age,kmDriven,Transmission,Owner,FuelType,PostedDate,AdditionInfo,AskPrice
0,Honda,City,2001,23,"98,000 km",Manual,second,Petrol,Nov-24,"Honda City v teck in mint condition, valid gen...","₹ 1,95,000"
1,Toyota,Innova,2009,15,190000.0 km,Manual,second,Diesel,Jul-24,"Toyota Innova 2.5 G (Diesel) 7 Seater, 2009, D...","₹ 3,75,000"
2,Volkswagen,VentoTest,2010,14,"77,246 km",Manual,first,Diesel,Nov-24,"Volkswagen Vento 2010-2013 Diesel Breeze, 2010...","₹ 1,84,999"
3,Maruti Suzuki,Swift,2017,7,"83,500 km",Manual,second,Diesel,Nov-24,Maruti Suzuki Swift 2017 Diesel Good Condition,"₹ 5,65,000"
4,Maruti Suzuki,Baleno,2019,5,"45,000 km",Automatic,first,Petrol,Nov-24,"Maruti Suzuki Baleno Alpha CVT, 2019, Petrol","₹ 6,85,000"

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9582 entries, 0 to 9581
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Brand         9582 non-null   object
 1   model         9582 non-null   object
 2   Year          9582 non-null   int64
 3   Age           9582 non-null   int64
 4   kmDriven      9535 non-null   object
 5   Transmission  9582 non-null   object
 6   Owner         9582 non-null   object
 7   FuelType      9582 non-null   object
 8   PostedDate    9582 non-null   object
 9   AdditionInfo  9582 non-null   object
 10  AskPrice      9582 non-null   object
dtypes: int64(2), object(9)
memory usage: 823.6+ KB

In [6]:
df.describe()

              Year          Age
count  9582.000000  9582.000000
mean   2016.361094     7.638906
std       4.087226     4.087226
min    1986.000000     0.000000
25%    2014.000000     5.000000
50%    2017.000000     7.000000
75%    2019.000000    10.000000
max    2024.000000    38.000000

2.1. What is the shape of the DataFrame? How many dimensions does it have?

In [9]:
df.shape

(9582, 11)

In [10]:
df.ndim

2

3. display only the Brand ,model and year columns

In [11]:
df[["Brand", "model", "Year"]]

              Brand      model  Year
0             Honda       City  2001
1            Toyota     Innova  2009
2        Volkswagen  VentoTest  2010
3     Maruti Suzuki      Swift  2017
4     Maruti Suzuki     Baleno  2019
...             ...        ...   ...
9577          Skoda    Octavia  2014
9578  Maruti Suzuki   Alto-800  2020
9579  Maruti Suzuki       Ritz  2013
9580        Hyundai      Verna  2019
9581        Hyundai    New i20  2021

[9582 rows x 3 columns]

4. what brand is most sold?

In [13]:
df["Brand"].mode()

0    Maruti Suzuki
Name: Brand, dtype: object

5. how many different models are there?

In [14]:
df['model'].nunique()

400

6. What is the percentage of occurrences for each brand in the given column of the DataFrame?

In [16]:
df['Brand'].value_counts(normalize=True)

Brand
Maruti Suzuki    0.283866
Hyundai          0.159570
Honda            0.083699
Toyota           0.081090
Mahindra         0.058443
Mercedes-Benz    0.041954
Tata             0.040597
BMW              0.035692
Volkswagen       0.033187
Audi             0.027552
Ford             0.025569
Renault          0.025047
Skoda            0.019098
Kia              0.016802
Chevrolet        0.009288
MG               0.008349
Nissan           0.007827
Jeep             0.007723
Land Rover       0.007410
Volvo            0.005009
Mini             0.004279
Jaguar           0.003548
Porsche          0.002505
Datsun           0.002296
Fiat             0.002296
Lexus            0.002087
Mitsubishi       0.001879
Isuzu            0.001044
Force            0.000626
Ambassador       0.000313
Rolls-Royce      0.000209
Opel             0.000209
Bajaj            0.000209
Ssangyong        0.000209
Aston Martin     0.000104
ICML             0.000104
Ashok            0.000104
Bentley          0.000104
Maserati         0.000104
Name: proportion, dtype: float64